Modules/LandingPage/Entities/LandingPageSetting.php

    public static function settings()
    {
        $data = LandingPageSetting::get();
---
select * from `landing_page_settings`