app/Http/Controllers/BillController.php

select * from `custom_fields` where `created_by` = 1 and `module` = 'bill'
select CONCAT(code, " - ", name) AS code_name, id from `chart_of_accounts` where `created_by` = 1
select `chart_of_accounts`.`id`, `chart_of_accounts`.`code`, `chart_of_accounts`.`name`, `chart_of_account_parents`.`account` from `chart_of_accounts` left join `chart_of_account_parents` on `chart_of_accounts`.`parent` = `chart_of_account_parents`.`id` where `chart_of_accounts`.`parent` != 0 and `chart_of_accounts`.`created_by` = 1
---
    public function create($vendorId)
    {

        if (\Auth::user()->can('create bill')) {
            $customFields = CustomField::where('created_by', '=', \Auth::user()->creatorId())->where('module', '=', 'bill')->get();
            $category     = ProductServiceCategory::where('created_by', \Auth::user()->creatorId())->where('type', 'expense')->orderBy('name', 'asc')->get()->pluck('name', 'id');
            $category->prepend('Select Category', '');

            $bill_number = \Auth::user()->billNumberFormat($this->billNumber());
            $venders     = Vender::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
            $venders->prepend('Select Vendor', '');

            $product_services = ProductService::where('created_by', \Auth::user()->creatorId())
                ->orderBy('name', 'asc')
                ->get()
                ->pluck('name', 'id')
                ->prepend('Select Item', '');
            $product_services->prepend('Select Item', '');
            $productCategoryMap = ProductService::where('created_by', \Auth::user()->creatorId())->pluck('category_id', 'id');

            $chartAccounts = ChartOfAccount::select(\DB::raw('CONCAT(code, " - ", name) AS code_name, id'))
                ->where('created_by', \Auth::user()->creatorId())->get()
                ->pluck('code_name', 'id');
            $chartAccounts->prepend('Select Account', '');

            $subAccounts = ChartOfAccount::select('chart_of_accounts.id', 'chart_of_accounts.code', 'chart_of_accounts.name', 'chart_of_account_parents.account');
            $subAccounts->leftjoin('chart_of_account_parents', 'chart_of_accounts.parent', 'chart_of_account_parents.id');
            $subAccounts->where('chart_of_accounts.parent', '!=', 0);
            $subAccounts->where('chart_of_accounts.created_by', \Auth::user()->creatorId());
            $subAccounts = $subAccounts->get()->toArray();