app/Http/Controllers/DashboardController.php

    public function index()
    {
        // Si no está autenticado, mantiene tu lógica actual
        if (!Auth::check()) {
            if (!file_exists(storage_path() . "/installed")) {
                header('location:install');
                die;
            }

            $settings = Utility::settings();

            if (($settings['display_landing_page'] ?? null) === 'on' && \Schema::hasTable('landing_page_settings')) {
                return view('landingpage::layouts.landingpage');
            }

            return redirect('login');
        }

        // Si está autenticado pero NO tiene permiso, NO renderizamos el dashboard (evita undefined vars)
        if (!\Auth::user()->can('show dashboard')) {
            abort(403, 'No autorizado para ver el dashboard.');
        }

        $data = [];

        // Últimos registros
        $data['latestIncome']  = Revenue::where('created_by', \Auth::user()->creatorId())->orderBy('id', 'desc')->limit(5)->get();
        $data['latestExpense'] = Payment::where('created_by', \Auth::user()->creatorId())->orderBy('id', 'desc')->limit(5)->get();

        // Income by category
        $incomeCategory = ProductServiceCategory::where('created_by', \Auth::user()->creatorId())
            ->where('type', 'income')
            ->get();
---
select * from `revenues` where `created_by` = 1 order by `id` desc limit 5
select * from `payments` where `created_by` = 1 order by `id` desc limit 5
select * from `product_service_categories` where `created_by` = 1 and `type` = 'expense'