app/Http/Controllers/LanguageController.php

update `users` set `lang` = 'es', `users`.`updated_at` = '2025-12-15 14:34:29' where `id` = 1
---
    public function changeLanquage($lang)
    {
        $user       = Auth::user();
        $user->lang = $lang;
        $user->save();