app/Http/Controllers/RoleController.php

select * from `roles` where `created_by` = 1 and `created_by` = 1
---
    public function index()
    {
        if(\Auth::user()->can('manage role'))
        {
            $roles = Role::where('created_by', '=', \Auth::user()->creatorId())->where('created_by', '=', \Auth::user()->creatorId())->get();

            return view('role.index')->with('roles', $roles);