app/Models/Status.php

select `name` from `statuses` where `id` = 0 limit 1
---
    public static function getNameById($id)
    {
        return self::where('id', $id)->value('name');

select `name`, `id` from `statuses`
---
    public static function getAllAsArray(): array
    {
        return self::pluck('name', 'id')->toArray();