app/Models/User.php

select count(*) as aggregate from `customers` where `created_by` = 1
---
    public function countCustomers()
    {
        return Customer::where('created_by', '=', $this->creatorId())->count();

select count(*) as aggregate from `venders` where `created_by` = 1
---
    public function countVenders()
    {
        return Vender::where('created_by', '=', $this->creatorId())->count();

select count(*) as aggregate from `invoices` where `created_by` = 1
---
    public function countInvoices()
    {
        return Invoice::where('created_by', '=', $this->creatorId())->count();

select count(*) as aggregate from `bills` where `created_by` = 1
---
    public function countBills()
    {
        return Bill::where('created_by', '=', $this->creatorId())->count();

select sum(`amount`) as aggregate from `revenues` where `created_by` = 1 and Date(date) = CURDATE() and `created_by` = 1
select * from `invoices` where `created_by` = 1 and Date(send_date) = CURDATE()
---
    public function todayIncome()
    {
        $revenue      = Revenue::where('created_by', '=', $this->creatorId())->whereRaw('Date(date) = CURDATE()')->where('created_by', \Auth::user()->creatorId())->sum('amount');
        $invoices     = Invoice::select('*')->where('created_by', \Auth::user()->creatorId())->whereRAW('Date(send_date) = CURDATE()')->get();

select sum(`amount`) as aggregate from `payments` where `created_by` = 1 and `created_by` = 1 and Date(date) = CURDATE()
select * from `bills` where `created_by` = 1 and Date(send_date) = CURDATE()
---
    public function todayExpense()
    {
        $payment = Payment::where('created_by', '=', $this->creatorId())->where('created_by', \Auth::user()->creatorId())->whereRaw('Date(date) = CURDATE()')->sum('amount');

        $bills = Bill::select('*')->where('created_by', \Auth::user()->creatorId())->whereRAW('Date(send_date) = CURDATE()')->get();

select sum(`amount`) as aggregate from `revenues` where `created_by` = 1 and MONTH(date) = '12'
select * from `invoices` where `created_by` = 1 and MONTH(send_date) = '12'
---
    public function incomeCurrentMonth()
    {
        $currentMonth = date('m');
        $revenue      = Revenue::where('created_by', '=', $this->creatorId())->whereRaw('MONTH(date) = ?', [$currentMonth])->sum('amount');

        $invoices = Invoice::select('*')->where('created_by', \Auth::user()->creatorId())->whereRAW('MONTH(send_date) = ?', [$currentMonth])->get();

select sum(`amount`) as aggregate from `payments` where `created_by` = 1 and MONTH(date) = '12'
select * from `bills` where `created_by` = 1 and MONTH(send_date) = '12'
---
    public function expenseCurrentMonth()
    {
        $currentMonth = date('m');

        $payment = Payment::where('created_by', '=', $this->creatorId())->whereRaw('MONTH(date) = ?', [$currentMonth])->sum('amount');

        $bills     = Bill::select('*')->where('created_by', \Auth::user()->creatorId())->whereRAW('MONTH(send_date) = ?', [$currentMonth])->get();

select sum(amount) amount from `revenues` where `created_by` = 1 and year(`date`) = '2025' and month(`date`) = 1 limit 1
select * from `invoices` where `created_by` = 1 and year(`send_date`) = '2025' and month(`send_date`) = 1
select sum(amount) amount from `payments` where `created_by` = 1 and year(`date`) = '2025' and month(`date`) = 1 limit 1
select * from `bills` where `created_by` = 1 and year(`send_date`) = '2025' and month(`send_date`) = 1
---
    public function getincExpBarChartData()
    {
        $month[]          = __('January');
        $month[]          = __('February');
        $month[]          = __('March');
        $month[]          = __('April');
        $month[]          = __('May');
        $month[]          = __('June');
        $month[]          = __('July');
        $month[]          = __('August');
        $month[]          = __('September');
        $month[]          = __('October');
        $month[]          = __('November');
        $month[]          = __('December');
        $dataArr['month'] = $month;


        for ($i = 1; $i <= 12; $i++) {
            $monthlyIncome = Revenue::selectRaw('sum(amount) amount')->where('created_by', '=', $this->creatorId())->whereRaw('year(`date`) = ?', array(date('Y')))->whereRaw('month(`date`) = ?', $i)->first();
            $invoices      = Invoice::select('*')->where('created_by', \Auth::user()->creatorId())->whereRaw('year(`send_date`) = ?', array(date('Y')))->whereRaw('month(`send_date`) = ?', $i)->get();

            $invoiceArray = array();
            foreach ($invoices as $invoice) {
                $invoiceArray[] = $invoice->getTotal();
            }
            $totalIncome = (!empty($monthlyIncome) ? $monthlyIncome->amount : 0) + (!empty($invoiceArray) ? array_sum($invoiceArray) : 0);


            $incomeArr[] = !empty($totalIncome) ? number_format($totalIncome, 2) : 0;

            $monthlyExpense = Payment::selectRaw('sum(amount) amount')->where('created_by', '=', $this->creatorId())->whereRaw('year(`date`) = ?', array(date('Y')))->whereRaw('month(`date`) = ?', $i)->first();
            $bills          = Bill::select('*')->where('created_by', \Auth::user()->creatorId())->whereRaw('year(`send_date`) = ?', array(date('Y')))->whereRaw('month(`send_date`) = ?', $i)->get();

select sum(amount) amount from `revenues` where `created_by` = 1 and date = '2025-12-15' limit 1
select * from `invoices` where `created_by` = 1 and send_date = '2025-12-15'
select sum(amount) amount from `payments` where `created_by` = 1 and date = '2025-12-15' limit 1
select * from `bills` where `created_by` = 1 and send_date = '2025-12-15'
---
    public function getIncExpLineChartDate()
    {
        $usr           = \Auth::user();
        $m             = date("m");
        $de            = date("d");
        $y             = date("Y");
        $format        = 'Y-m-d';
        $arrDate       = [];
        $arrDateFormat = [];

        for ($i = 0; $i <= 15 - 1; $i++) {
            $date = date($format, mktime(0, 0, 0, $m, ($de - $i), $y));

            $arrDay[]        = date('D', mktime(0, 0, 0, $m, ($de - $i), $y));
            $arrDate[]       = $date;
            $arrDateFormat[] = date("d-M", strtotime($date));;
        }
        $dataArr['day'] = $arrDateFormat;
        for ($i = 0; $i < count($arrDate); $i++) {
            $dayIncome = Revenue::selectRaw('sum(amount) amount')->where('created_by', \Auth::user()->creatorId())->whereRaw('date = ?', $arrDate[$i])->first();

            $invoices     = Invoice::select('*')->where('created_by', \Auth::user()->creatorId())->whereRAW('send_date = ?', $arrDate[$i])->get();
            $invoiceArray = array();
            foreach ($invoices as $invoice) {
                $invoiceArray[] = $invoice->getTotal();
            }

            $incomeAmount = (!empty($dayIncome->amount) ? $dayIncome->amount : 0) + (!empty($invoiceArray) ? array_sum($invoiceArray) : 0);
            $incomeArr[]  = str_replace(",", "", number_format($incomeAmount, 2));

            $dayExpense = Payment::selectRaw('sum(amount) amount')->where('created_by', \Auth::user()->creatorId())->whereRaw('date = ?', $arrDate[$i])->first();

            $bills     = Bill::select('*')->where('created_by', \Auth::user()->creatorId())->whereRAW('send_date = ?', $arrDate[$i])->get();

select * from `invoices` where `created_by` = 1 and `issue_date` >= '2025-12-08' and `issue_date` <= '2025-12-15'
---
    public function weeklyInvoice()
    {
        $staticstart  = date('Y-m-d', strtotime('last Week'));
        $currentDate  = date('Y-m-d');
        $invoices     = Invoice::select('*')->where('created_by', \Auth::user()->creatorId())->where('issue_date', '>=', $staticstart)->where('issue_date', '<=', $currentDate)->get();

select * from `invoices` where `created_by` = 1 and `issue_date` >= '2025-11-15' and `issue_date` <= '2025-12-15'
---
    public function monthlyInvoice()
    {
        $staticstart  = date('Y-m-d', strtotime('last Month'));
        $currentDate  = date('Y-m-d');
        $invoices     = Invoice::select('*')->where('created_by', \Auth::user()->creatorId())->where('issue_date', '>=', $staticstart)->where('issue_date', '<=', $currentDate)->get();

select * from `bills` where `created_by` = 1 and `bill_date` >= '2025-12-08' and `bill_date` <= '2025-12-15'
---
    public function weeklyBill()
    {
        $staticstart = date('Y-m-d', strtotime('last Week'));
        $currentDate = date('Y-m-d');
        $bills       = Bill::select('*')->where('created_by', \Auth::user()->creatorId())->where('bill_date', '>=', $staticstart)->where('bill_date', '<=', $currentDate)->get();

select * from `bills` where `created_by` = 1 and `bill_date` >= '2025-11-15' and `bill_date` <= '2025-12-15'
---
    public function monthlyBill()
    {
        $staticstart = date('Y-m-d', strtotime('last Month'));
        $currentDate = date('Y-m-d');
        $bills       = Bill::select('*')->where('created_by', \Auth::user()->creatorId())->where('bill_date', '>=', $staticstart)->where('bill_date', '<=', $currentDate)->get();